Dlubal.RFEM5.IMaterialIsotropicModel
Interface for working with material isotropic model

Dlubal.RFEM5.IMaterialIsotropicModel.GetData
Gets material isotropic model parameters.
Returns: Material isotropic model parameters

Dlubal.RFEM5.IMaterialIsotropicModel.SetData(System.UInt32@)
Sets material isotropic model parameters.
Data: Material isotropic model parameters

Dlubal.RFEM5.IMaterialIsotropicModel.GetDiagram
Gets material stress-strain diagram.
Returns: Stress-strain diagram

Dlubal.RFEM5.IMaterialIsotropicModel.SetDiagram(System.UInt32@)
Sets material stress-strain diagram.
Diagram: Stress-strain diagram